Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Поставки.Записывать = Истина;
	Движения.Себестоимость.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары из Товары Цикл
		
		// регистр ОстаткиТоваров
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.ПродажиНоменклатуры = ТекСтрокаТовары.Количество;
		
		// регистр Поставки
		Движение = Движения.Поставки.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Поставщик;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Итого;
		
		// регистр Себестоимость
		Движение = Движения.Себестоимость.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Итого;
		
	КонецЦикла;

	// регистр РегистрБухгалтерии
	Движения.РегистрБух.Записывать = Истина;
	Движение = Движения.РегистрБух.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.БухУчет.Товары;
	Движение.СчетКт = ПланыСчетов.БухУчет.РасчетыСПостащиками;
	Движение.Сумма = СуммаДокумента;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
     	Возврат;
	КонецЕсли;
	
	СуммаДокумента=Товары.Итог("Итого");
	
КонецПроцедуры
