Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ЗадолженностиПередСотрудниками
	Движения.ЗадолженностиПередСотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть из ТабличнаяЧасть Цикл
		Движение = Движения.ЗадолженностиПередСотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = ТекСтрокаТабличнаяЧасть.Сотрудник;
		Движение.СуммаДолга = ТекСтрокаТабличнаяЧасть.СуммаВыплаты;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры