Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.Начисления.Записывать = Истина;
	Движения.ЗадолженностиПередСотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники из Сотрудники Цикл
		
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияСуммой;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Сумма = ТекСтрокаСотрудники.Сумма;
		
		Движение = Движения.ЗадолженностиПередСотрудниками.Добавить();
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.СуммаДолга = ТекСтрокаСотрудники.Сумма;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		
	КонецЦикла;

КонецПроцедуры;