ДниНедели = Новый Массив;
ДниНедели.Добавить("ДНИ НЕДЕЛИ:");
ДниНедели.Добавить("Понедельник");
ДниНедели.Добавить("Вторник");
ДниНедели.Добавить("Среда");
ДниНедели.Добавить("Четверг");
ДниНедели.Добавить("Пятница");
ДниНедели.Добавить("Суббота");
ДниНедели.Добавить("Воскресенье");

//ТекущийГод = Год(ТекущаяДата())-2000;
//Для Счетчик = ТекущийГод По ТекущийГод+10 Цикл
	//НомерДняНедели = ДеньНедели(Дата("20" + Строка(Счетчик) + "1231"));
	//Сообщить(ДниНедели[НомерДняНедели-1]);
//КонецЦикла

Для Каждого День из ДниНедели цикл
	Сообщить(День);
КонецЦикла;

//Действие на оперижение, хехехе