ДниНедели = Новый Массив;
ДниНедели.Добавить("Понедельник");
ДниНедели.Добавить("Вторник");
ДниНедели.Добавить("Среда");
ДниНедели.Добавить("Четверг");
ДниНедели.Добавить("Пятница");
ДниНедели.Добавить("Суббота");
ДниНедели.Добавить("Воскресенье");

Для Счетчик = Год(ТекущаяДата())-2000 По (Год(ТекущаяДата())-1991) Цикл
	НомерДняНедели = ДеньНедели(Дата("20" + Строка(Счетчик) + "1231"));
	Сообщить(ДниНедели[НомерДняНедели-1]);
КонецЦикла

//ПОЧЕМУ ЧИСЛА ПИШУТСЯ В ФОРМАТЕ "Ц ЦЦЦ" А НЕ "ЦЦЦЦ"!?!?!?!?!?!?!
//К слову, я не буду делать много "Если", если можно сделать проще, умнее и более читаемо